sdaiInsertNestedAggrAfter(Sdai_ItrId*)
\details
Inserts a new nested aggregate value into an application instance list after the element referenced by a specified iterator.
\param iterator [in] An iterator object that refers to the element to insert the new value.
\returns The inserted aggregate value.